posts/2016-05-08-a-mothers-day-prayer.org
#+date: <2016-05-08>
#+filetags: prayer religion
#+title: A Mothers Day Prayer

Gracious God,

Thank you for the precious people\\
who, quietly and humbly, have\\
been the hands and feet of Jesus for us,\\
who have celebrated our joys,\\
wept in our sorrows,\\
and sacrificed to help us\\
become everything you\\
have created us to be;\\
each one a gift of love\\
from your gracious hand.\\

May we also be a gift to others,\\
who need to see your grace, especially\\
the many women around the world\\
whose voices have been silenced,\\
some, sadly, by the church herself.

Give us the grace\\
to listen to those\\
who are rarely heard,\\
and to empower them\\
to share their gifts,\\
whatever they may be.

/Amen/
