docs/posts/2016-05-08-a-mothers-day-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Mothers Day Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A Mothers Day Prayer</h1>
<p class="subtitle" role="doc-subtitle">May 08, 2016</p>
</header><p>
Gracious God,
</p>

<p>
Thank you for the precious people<br>
who, quietly and humbly, have<br>
been the hands and feet of Jesus for us,<br>
who have celebrated our joys,<br>
wept in our sorrows,<br>
and sacrificed to help us<br>
become everything you<br>
have created us to be;<br>
each one a gift of love<br>
from your gracious hand.<br>
</p>

<p>
May we also be a gift to others,<br>
who need to see your grace, especially<br>
the many women around the world<br>
whose voices have been silenced,<br>
some, sadly, by the church herself.
</p>

<p>
Give us the grace<br>
to listen to those<br>
who are rarely heard,<br>
and to empower them<br>
to share their gifts,<br>
whatever they may be.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
